In [1]:
import pandas as pd
import numpy as np
import sqlite3 as sql

In [2]:
#Creando la conexion con la base de datos
database = "factbook.db"
connection = sql.connect(database)

In [3]:
def readingSQL(query):
    df=pd.read_sql_query(query,connection)
    return df.head()

In [5]:
query = '''
SELECT *
  FROM facts
    LIMIT 5;
'''

readingSQL(query)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,1,af,Afghanistan,652230,652230,0,32564342,2.32,38.57,13.89,1.51
1,2,al,Albania,28748,27398,1350,3029278,0.30,12.92,6.58,3.30
2,3,ag,Algeria,2381741,2381741,0,39542166,1.84,23.67,4.31,0.92
3,4,an,Andorra,468,468,0,85580,0.12,8.13,6.96,0.00
4,5,ao,Angola,1246700,1246700,0,19625353,2.78,38.78,11.49,0.46

In [6]:
query = '''SELECT min(population), max(population), min(population_growth), max(population_growth)
FROM facts;'''

readingSQL(query)

,min(population),max(population),min(population_growth),max(population_growth)
0,0,7256490011,0.0,4.02

In [7]:
query = '''SELECT name, population
  FROM facts
GROUP BY name
HAVING population = 0;'''

readingSQL(query)

         name  population
0  Antarctica           0

In [8]:
query = '''SELECT min(population), max(population), min(population_growth), max(population_growth)
FROM facts
WHERE population < (Select max(population)
                    FROM facts);'''

readingSQL(query)

,min(population),max(population),min(population_growth),max(population_growth)
0,0,1367485388,0.0,4.02

In [9]:
query = '''SELECT ROUND(AVG(population),3) AS Average_Population, ROUND(AVG(area),3) AS Average_Area
FROM facts;'''

readingSQL(query)

   Average_Population  Average_Area
0        6.209493e+07    555093.546